app/controllers/projects_controller.rb

SELECT * FROM "projects" ORDER BY name
---
  def index
    @projects = Project.all(:include => 'customer', :order => 'name')

INSERT INTO "projects" ("name", "updated_at", "description", "customer_id", "created_at") VALUES('SGF', '2009-09-07 23:08:13', 'Sistema de Gestão de Biblioteca', 1, '2009-09-07 23:08:13')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "description" = 'Sistema de Gestão de Biblioteca', "updated_at" = '2009-09-07 23:07:07' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT "customers".id FROM "customers" WHERE ("customers"."name" = 'Faculdade Castro Alves' AND "customers".id <> 1) LIMIT 1
---
	def load_customers
		@customers = Customer.all(:order => 'name').collect { |c| [c.name, c.id] }